[
  {
    "title": "Chose the best region",
    "priority": "High",
    "description": "ADX is a regional service, choosing the Azure region with the best fit is essential",
    "detail": "Put the cluster close to your data source, in order to minimize bandwidth cost and latency. Azure has more global regions than any other cloud provider—offering the scale needed to bring applications closer to users around the world, preserving data residency, and offering comprehensive compliance and resiliency options for customers.",
    "documentation": [
      {
        "title": "Azure regions",
        "url": "https://azure.microsoft.com/en-us/global-infrastructure/regions/"
      },
      {
        "title": "ADX availability by region",
        "url": "https://azure.microsoft.com/en-us/global-infrastructure/services/?products=data-explorer"
      }
    ],
    "tags": ["all"]
  },
  {
    "title": "Plan the ADX dimensioning",
    "priority": "High",
    "description": "Select the correct vertical and horizontal scale",
    "detail": "When you create a new cluster or optimize a cluster for a changing workload, Azure Data Explorer offers multiple virtual machine (VM) SKUs to choose from. The VMs have been carefully chosen to give you the most optimal cost for any workload.",
    "documentation": [
      {
        "title": "Select the correct VM SKU for your Azure Data Explorer cluster",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/manage-cluster-choose-sku"
      },
      {
        "title": "Manage cluster horizontal scaling (scale out) in Azure Data Explorer to accommodate changing demand",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/manage-cluster-horizontal-scaling"
      },
      {
        "title": "Manage cluster vertical scaling (scale up) in Azure Data Explorer to accommodate changing demand",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/manage-cluster-vertical-scaling"
      }
    ],
    "tools":[
      {
        "title": "ADX cost calculator",
        "url": "https://aka.ms/adx.cost"
      }
    ],
    "tags": ["all"]
  },
    {
      "title": "Assess reducing cost with reserved instances",
      "priority": "Medium",
      "description": "Save money in case you plan to use ADX for more than one or three years",
      "detail": "Save money with Azure Data Explorer by prepaying for the markup units compared to pay-as-you-go prices. With Azure Data Explorer reserved capacity, you make a commitment for Azure Data Explorer use for a period of one or three years to get a significant discount on the Azure Data Explorer markup costs. To purchase Azure Data Explorer reserved capacity, you only need to specify the term, it will apply to all deployments of Azure Data Explorer in all regions",
      "documentation": [
        {
          "title": "Prepay for Azure Data Explorer markup units with Azure Data Explorer reserved capacity",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/pricing-reserved-capacity"
        },
        {
          "title": "How to reduce cost with Azure Data Explorer Markup reserved capacity",
          "url": "https://techcommunity.microsoft.com/t5/azure-data-explorer/how-to-reduce-cost-with-azure-data-explorer-markup-reserved/ba-p/1054906"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Evaluate setting up diagnostic logs",
      "priority": "Medium",
      "description": "Collect data about ingestion, health and performance",
      "detail": "Azure Data Explorer uses diagnostic logs for insights on ingestion successes and failures. You can export operation logs to Azure Storage, Event Hub, or Log Analytics to monitor ingestion status. Logs from Azure Storage and Azure Event Hub can be routed to a table in your Azure Data Explorer cluster for further analysis.",
      "documentation": [
        {
          "title": "Monitor Azure Data Explorer ingestion operations using diagnostic logs",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/using-diagnostic-logs"
        },
        {
          "title": "How to Monitor Azure Data Explorer ingestion using diagnostic logs",
          "url": "https://techcommunity.microsoft.com/t5/azure-data-explorer/how-to-monitor-azure-data-explorer-ingestion-using-diagnostic/ba-p/1107252"
        }
      ],
      "tags": ["all", "monitoring"]
    },
    {
      "title": "Check if auto scale helps you optimizing cost",
      "priority": "Medium",
      "description": "Manage the scale of your Azure Data Explorer cluster",
      "detail": "Optimized autoscale is the recommended autoscale method. This method optimizes cluster performance and costs. If the cluster approaches a state of under-utilization, it will be scaled in. This action lowers costs but keeps performance level. If the cluster approaches a state of over-utilization, it will be scaled out to maintain optimal performance.",
      "documentation": [
        {
          "title": "Optimized autoscale",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/manage-cluster-horizontal-scaling#optimized-autoscale"
        },
        {
          "title": "Automatically scale your cluster size to optimize query performance and cost",
          "url": "https://techcommunity.microsoft.com/t5/azure-data-explorer/how-to-monitor-azure-data-explorer-ingestion-using-diagnostic/ba-p/1107252"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Judge if you need to segregate your deployment for multiple development environments",
      "priority": "Medium",
      "description": "Create a plan to segregate ADX environments for different development environments",
      "detail": "It makes a lot of sense to segregate ADX environments based on development environments like DEV, QA and PROD. Create a plan based on the requirements for the individual environments.",
      "tags": ["all"]
    },
    {
      "title": "Assess implications and recommendations for multi tenant applications",
      "priority": "Medium",
      "description": "Create a plan to segregate ADX environments for different projects",
      "detail": "ADX is a true multi tenant database and you can build SaaS offerings on top of it by deploying individual projects into dedicated databases.",
      "documentation": [
        {
          "title": "What are databases?",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/kusto/query/schema-entities/databases"
        },
        {
          "title": "Use follower database to attach databases in Azure Data Explorer",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/follower"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Assess how long you want to retain the data",
      "priority": "Medium",
      "description": "It's useful to remove data that continuously flows into a table, and whose relevance is age-based. For example, the policy can be used for a table that holds diagnostics events that may become uninteresting after two weeks.",
      "documentation": [
        {
          "title": "Retention policy",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/kusto/management/retentionpolicy"
        }
      ],
      "tags": ["all"]
    },
    {
      "title": "Create a caching strategy",
      "priority": "Medium",
      "description": "Data in hot cache is the major cost driver. Create a plan on how long which table needs to be kept in cache.",
      "detail": "Azure Data Explorer stores its ingested data in reliable storage (most commonly Azure Blob Storage), away from its actual processing (such as Azure Compute) nodes. To speed up queries on that data, Azure Data Explorer caches it, or parts of it, on its processing nodes, SSD, or even in RAM. Azure Data Explorer includes a sophisticated cache mechanism designed to intelligently decide which data objects to cache. The cache enables Azure Data Explorer to describe the data artifacts that it uses, so that more important data can take priority. For example, column indexes and column data shards,",
      "documentation": [
        {
          "title": "Cache policy (hot and cold cache)",
          "url": "https://docs.microsoft.com/en-us/azure/data-explorer/kusto/management/cachepolicy"
        }
      ],
      "tags": ["all"]
    }
] 
