[
  {
    "title": "Plan for different workloads types",
    "priority": "Medium",
    "description": "ADX supports in place sharing of data",
    "detail" : "Azure Data Explorer decouples the storage and compute which allows customers to run multiple compute (read-only) instances on the same underlying storage. You can attach a database as a follower database, which is a read-only database on a remote cluster",
    "documentation": [
      {
        "title": "Use Azure Data Share to share data with Azure Data Explorer",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/data-share"
      }
    ],
    "tags": ["all", "optional"]
  },
  {
    "title": "Assess if data stored in ADX is GDPR relevant",
    "priority": "Low",
    "description": "Consider implementing a process how to delete personal identifiable data",
    "detail" : "As a data platform, Azure Data Explorer supports the ability to delete individual records, through the use of Kusto .purge and related commands.",
    "documentation": [
      {
        "title": "Data purge",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/kusto/concepts/data-purge"
      },
      {
        "title": "GDPR section of the Service Trust portal",
        "url": "https://servicetrust.microsoft.com/ViewPage/GDPRGetStarted"
      }
    ],
    "tags": ["all", "optional"]
  },
  {
    "title": "Evaluate your disaster recovery/resiliency needs",
    "priority": "Low",
    "description": "enable your business to continue operating in the face of a true disruption",
    "detail" : "Azure Data Explorer currently does not support an automatic protection against the outage of an entire Azure region. Theoretically this can happen in case of a natural disaster like an earthquake",
    "documentation": [
      {
        "title": "Azure Data Explorer and business continuity",
        "url": "https://techcommunity.microsoft.com/t5/azure-data-explorer/azure-data-explorer-and-business-continuity/ba-p/1332767"
      }
    ],
    "tags": ["all", "resiliency", "optional"]
  },
  {
    "title": "Evaluate deploying into Azure Availability Zones",
    "priority": "Low",
    "description": "Protect an Azure Data Explorer cluster from partial region failure",
    "detail" : "Deploying a new cluster to different availability zones means the underlying compute and storage components are deployed to different zones in the region with independent power, cooling and networking. In a case of a zonal downtime the cluster will continue to work, but it might have performance degradation until the failure will be resolved",
    "documentation": [
      {
        "title": "Deployment guide",
        "url": "https://docs.microsoft.com/en-us/azure/data-explorer/create-cluster-database-portal"
      },
      {
        "title": "Enhanced security and resiliency with your Azure Data Explorer cluster",
        "url": "https://techcommunity.microsoft.com/t5/azure-data-explorer/enhanced-security-and-resiliency-with-your-azure-data-explorer/ba-p/843872"
      }
    ],
    "tags": ["all", "resiliency", "optional"]
  },
  {
    "title": "Assess and practice how to leverage Azure Support Center Solutions",
    "priority": "Low",
    "description": "Automatically get your cluster diagnosed for any known issues",
    "detail": "This ability is needed to automatically get your cluster diagnosed for any known issues and be provided automatically with solutions to these issues. This feature is surfaced both as part of the “Diagnose and Solve Problems” blade or through the “New Support Request” blade. In the “Diagnose and Solve Problems” blade you will be provided with common problems, and based on the problem you choose we will automatically try to detect issues on your cluster, and will be provide you with recommended common solutions to the issue.",
    "tags": ["all", "education"]
  }
] 
